Repository: mozilla-l10n/mt-training-data
Catalog: gju/gju_pontoon.tmx
Source language: en_us
Languages: gju

source: The route was unclear.
gju: راہ صاف نیہہ تھو

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
gju: یہ زبان اس وخت کمیونٹی کی ترقی کے اندر ہے۔<localizationGlossaryLink> ویب سائٹ لوکلائزیشن </localizationGlossaryLink> تے <sentenceCollectionGlossaryLink> جملاں نا جمع کرن وسطے </sentenceCollectionGlossaryLink> دوبارہ متعارف کی ضرورت ہے

source: The selected file is too large
gju: جیہڑی فائل چنی ہے واہ مچ بڑی ہے

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
gju: فقراں نا جمع کرن ہالو عام زباناں کا پلیٹ فارم پو جائے لگو ۔تم ہون <writeURL>لکھ سکے </writeURL>ایک فقرو <reviewURL>جائزو لے سکے </reviewURL> ایکو ہی

source: The sentence has a grammatical or spelling error.
gju: اس فقرہ ما گرائمر یا سپیلنگ کی غلطی ہے

source: The sentence has disrespectful or offensive language.
gju: اس جُملا ما نہ پسند آن ہالی زبان ہے

source: The sentence must be grammatically correct.
gju: فقراں گرائمر کا لحاظ نال لازمی دُرست وھے

source: The sentence must be speakable.
gju: فقراں پرھن کے لازمی قابل وھے

source: The sentence must be spelled correctly.
gju: فقراں ما سپیلنگ لازمی صحیح وھے

source: The sentence should have fewer than 15 words.
gju: فقرا ما 15 تے کم حروف ہونا چاہیے

source: The site is ready to be launched when it reaches 75% completion.
gju: سائیٹ شروع کرن واسطے تیار ہے جد یاہ پ 75 فیصد پو ری ہو جائے

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
gju: جتنو جھب ممکن ہووے گو یاہ سائٹ بھی چلے گی۔تازہ ترین معلومات وسطے مہربانی کر کے <matrixLink> میٹرکس کمیونٹی چیٹ </matrixLink> اپر مہارے نال شامل ہو جاو یا فر <githubLink>گٹ حب </githubLink> یا <discourseLink> کوئی چیز شامل کرن وسطے یا سائٹ کی نگرانی وسطے مہارا ڈسکورس فورم </discourseLink> نا دیکھوں

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
gju: ٹی ای ڈی-ایل آئی یو ایم کارپس صوتی گفتگو تے ٹی ای ڈی ویب سائٹ اپر دستیاب ان کی وازں کا تجزیہ (ٹرانسکرپشن) تے بنایو گیو تھو۔

source: The website text is translated into that language.
gju: ویب سائیٹ کو متن اُس زبان ما ترجمو کیو ہے

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
gju: یوہ مواد کسے بند کی شناخت کے متعلق ذاتی طور اپر قابل شناخت معلومات پر مشتمل ہے، جس طرحیا کہ اس کو ناں، ای میل پتو، جا، شناختی نمبر، یا فون نمبر

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
gju: یاہ معلومات دینی اختیاری ہے ۔ کدے آسانی محسو س کرے تے تم یاہ جمع کروں ۔ جد ہم ڈیٹا سیٹ نا جاری کراں تے ہم ساری ذاتی معلومات کو تخصص کراں اور اس گل نا یقینی بناں جے تھارو ناں تے ای میل جیسی معلومات تھاری ذاتی معلومات یعنی عمر تے جنس نال جڑی نیہہ ہے

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
gju: یہ معلومات دین ما تھہای مرضی ہے۔ جے کدے تمنا ہچھو لگے فر ہی یہ معلومات دیوں۔ جس وخت ہم ڈیٹا سیٹ جاری کراں، تے ہم ساری ذاتی معلومات نا فرضی طور اپر دساں، تے اس گل کو پورو یقین کراں جے تھہارو ناں ، ای میل رہن کی معلومات، عمر تے جنس کی معلومات اس ما شامل نیہہ۔ ٹکنالوجی وسطے ہر ایک وسطے ہچھی طرحیا کم کرن وسطے ، وہ معلومات ڈویلپرز نا ٹیکنالوجی بنان ما مدد کرے، لوکاں کی بکھ بکھ درجہ بندی نا ظاہر کرن کی ضرورت ہے۔ اس بارہ ما مزید جانیں کہ میٹا ڈیٹا کس وجہ نال اہمیت رکھے۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
gju: یوہ ایک استعمال کیس تیں چلن آلو ٹکڑو ہے جس ما بولن آلا ہندساں کی شناخت تے ہاں / نہیں کا پتو کرن وسطے اعداد و شمار شامل ہیں۔

source: This is how you cite yourself if you wrote the content yourself.
gju: کس طرح تم اپنو حوالو دے سکے کدے تم نے متن خود لکھیو ہے

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
gju: یوہ منصوبو تھہارے جیا لوکاں کی مدد کے بغیر ممکن نیہہ ہوسے۔ کامن وائس ما شامل ہون وسطے ہور مچ طریقہ ہیں۔ تمنا یاہ گل پچھن کی ضرورت نیہہ جے حصو لین وسطے اس کو کوڈ کے ہے

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
gju: یوہ سیٹ تھارا لیڈر بورڈ کی ظاہر حالت نا کنٹرول کرے ۔جد چھپ جائے تھاری ترقی پرائیویٹ ہو جائے ۔ اس کو مطلب یوہ ھوہے استعمال کرن ہالا کو ناں تے ترقی ظاہر نیہہ ہوسے لیڈر بورڈ پو ۔اس چیز نا نوٹ کروں کہ لیڈر بورڈ ری فریش ہون ما منٹ لیے { $minutes } تبدیلی نا گنن واسطے ۔،

source: Three to go!
gju: چلن واسطے ترے

source: Thur
gju: تھر

source: Tibetan
gju: تبتی

source: Tigre
gju: ٹگری

source: Tigrinya
gju: ٹیگرینیا

source: Tlazoyaltepec Mixtec
gju: تلازوئیالٹیپک مکسٹیک

source: Toba Qom
gju: توبا کوم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
gju: ای میل نا بدلان یا ترمیم کرن وسطے ہمنا <emailFragment>commonvoice@mozilla.com</emailFragment> اپر ای میل چلاو

source: Today
gju: اج

source: Today's Common Voice progress on clips recorded
gju: اَج کی عمومی ترقی کامن وائس کی کلپس ریکارڈ کرن کی

source: Today's Common Voice progress on clips validated
gju: کلپس کی توثیق کی اج کی کامن وائس کی عمومی ترقی

source: Today's Progress
gju: اج کی ترقی

source: Toki Pona
gju: ٹوکی پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
gju: اس نا کامن وائس کا ڈیٹا سیٹ ما بنان واسطے واز کا کلپ کی تصدیق دو استعمال کرن ہالاں کی طرفوں ہونی چاہیے

source: Too many files
gju: فائل مُچ زیادہ ہے

source: Top Contributors
gju: بڑا حصہ دار

source: Torwali
gju: توروالی

source: Total
gju: کل

source: Total Approved
gju: ساری منظوری

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
gju: سجے پاسے ہم فائدہ کو ایک خاکو پیش کراں تے وضاحت کراں جے ہم کہڑی معلومات عام کراں ۔ اپنا آلہ (ڈیوائس)اپر اپنا عام صوتی اکاونٹ تے شروع کرن وسطے تلے جہڑو لنک دتو ہے اس نا استعمال کرو۔

source: Toward next goal
gju: اگلی منزل کے۔

source: Track progress here and on your stats page.
gju: ترقی نا ات دیکھو تے سٹیٹس کا صفحہ پو

source: Transcribe
gju: اسکو تجزیو کرو

source: Transcribe answers
gju: جواباں کو تجزیو کرو

source: Transcribe Audio
gju: صوتی تجزیو

source: Transcribe audio recordings into text
gju: واز کی ریکارڈنگ نا عبارت ما نقل کروں

source: Transcribe audio recordings in your language
gju: اپنی زبان ما واز کی نقل کروں

source: Transcribe Audio <small>(Coming soon)</small>
gju: آڈیو کو تجزیو کرو<small>(بہلاں آوے گو)</small>

source: Transcript edited successfully
gju: تجزیہ کی ترمیم کامیابی نال ہو گئی

source: Transcript skipped successfully
gju: تجزیہ تے کامیابی نال آگے نکل گیا

source: Transcript submitted successfully
gju: تجزیو کامیابی نال جمع ہو گیو ہے

source: Transcript voted successfully
gju: تجزیو کامیاب ہو گیو

source: Transgender
gju: کھسرو

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
gju: <translateVideoLink>مھاری ہدایت نا دیکھوں کہ پنٹوں نا کِنوں استعمال کرے </translateVideoLink>

source: Translating the site
gju: سائیٹ کو ترجمو کرنو

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
gju: ترجمہ انگریزی تے ہے لیکن تم دیکھ سکے <strong>تجاویز </strong>دُوجی زباناں ما۔کلک کروں <strong>فائل ،آئیکن ،فر <strong>ترتیبات </strong>لنک کرو تے جمع کرو کوئی وی زبان جہڑی تم بولے۔ ترلے سِرے سجا ہتھ پو کونا ما لسٹ وھے گی ترجمہ کی جس نا <strong> لوکلز کہے </strong>۔ترجمو سائیٹ پو ایک سن کاہڈ دسے گو ۔

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
gju: کامن وائس کو ترجمو موجود ہے <strong>پونٹون پو </strong>

source: Try again by dragging your file here
gju: اپنی فائل نا لان واسطے دوبارا کوشش کروں

source: Try uploading again
gju: اپ لوڈ کرن کی دوبارا کوشش کروں

source: Tshivenda
gju: تشوندا

source: Tunen
gju: ٹیونن

source: Tupuri
gju: توپوری

source: Turkish
gju: ترکی

source: Turkmen
gju: ترکمانی

source: Tush
gju: ٹش

source: Tuvan
gju: توان

source: Twi
gju: توی

source: Typically megabytes
gju: عام طور اپر میگا بائٹس

source: Ubykh
gju: ابیخ

source: Udmurt
gju: ادمورت

source: Ukrainian
gju: یوکرینی

source: Understand contribution criteria
gju: حصّہ لین کا اصول نا سجمھو

source: Understand how to contribute and validate sentences and audio clips to the Common Voice dataset
gju: اس گل نا سمجھوں جے کامن وائس ڈیٹا سیٹ اپر وازاں کا حصہ تے جملاں کی توثیق وسطے کس طرحیا کردار ادا کیو جا سکے

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
gju: اس نا سمجنو جہڑی شے واز کا کلپس ما سنن کی ہے ۔ اپنی واز نا زیادہ محفوظ کروں

source: Universities, Academics and Researchers
gju: یونیورسٹی، ماہرین تعلیم تے تحقیق کرن آلا

source: Upload aborted. Do you want to delete your recordings?
gju: اُپر چاہرن کو کم روک چھُڑیو ، آیو تم اپنی ریکارڈنگ کا ختم کرنو چاہوے ؟

source: Upload an image file
gju: فوٹو آلی ایک چیز اپ لوڈ کرو

source: { $uploadedQuestions } of { $totalQuestions } questions collected
gju: { $uploadedQuestions }{ $totalQuestions } ما سوال جمع ہو گیا

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
gju: { $uploadedQuestions }{ $totalQuestions } بچوں سوال جمع ہو گیا <guidelinesLink> رہنمائی </guidelinesLink> نواں سوال کو اضافو کرن کا طریقہ کا بارہ ما سمجھن وسطے تم رہنمائی آلاصفحہ نا دیکھو ۔

source: { $uploadedSentences } of { $totalSentences } sentences collected
gju: { $uploadedSentences }فقرا نا جمع کرن کو { $totalSentences }

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
gju: <downloadLink>ات فقرا نا جمع کرن کو { $totalSentences } کلک

source: Upload failed, please retry.
gju: اپ لوڈ ناکام ہو گیو ،برائے مہربانی دوبارہ کوشش کرو

source: Upload <icon></icon> public domain sentences
gju: اپلوڈ کروں <icon>پبلک کا ڈومین کو فقرو </icon>

source: Upload in progress...
gju: اپ لوڈ کو عمل جاری ہے

source: Upload more sentences?
gju: ہور زیادہ فقرا اپ لوڈ کروں

source: Upload of this clip keeps failing at server. Reload the page or try again later.
gju: یوہ حصو سرور اپر اپ لوڈ ہون مسلو بناوے۔ اس صفحہ نا دوبارہ چلاو یا تھوڑی دیر تے کاہڈ بھی کوشش کریوں

source: Upload of this clip keeps failing, keep retrying?
gju: یوہ حصو اپ لوڈ نیہہ ہوتو، کوشش کرو گا؟

source: Urdu
gju: اردو

source: Use correct grammar
gju: صحیح گرائمر کو استعمال کروں

source: Use correct spelling and grammar
gju: صحیح گرامر تے سپیلنگ کو استعمال کرو

source: Use correct spelling and punctuation
gju: صحیح سپیلنگ تے رموز اوقاف کو استعما ل کروں

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
gju: یوہ <mark> بنیاد انسانی گل بات کا حوالہ نال </mark> تے کیس کا حوالہ نال مفید ہے۔(مثال کے طور اپر جس وخت تم انہاں لوکاں نال گل کرو جیہڑا اس زبان ما گل کریں جیہڑٰی لکھی وی نیہہ یا فر رعام بول چال ہووے )

source: User Name
gju: صارف کو ناں

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
gju: صارفین عطیو کری وی کلپس کی درستگی کی توثیق کرے ، یوہ جانتاں واں کہ پڑھن ہالا ں نے جملو صحیح طریقہ نال پڑھیو ہے۔

source: Ushojo
gju: اشوجو

source: Uyghur
gju: اوغور

source: Uzbek
gju: ازبکی

source: Validated Clips
gju: تصحیح کری وی کلپس

source: Validated Hours
gju: تصدیق شدہ گھنٹا

source: Validated Hr. Total
gju: تصدیق شدہ ۔ ایچ آر ٹوٹل

source: Validate readings
gju: پرھی وی چیز کی تصدیق کرو

source: Validate Readings
gju: پڑھن کی تصدیق کروں

source: Validate Readings, Review Transcriptions
gju: پڑھن ہالا ں کی تصدیق کروں ، نقلاں کو جائزو لیو

source: Validate Readings <small>(Coming soon)</small>
gju: لکھائی کی تصدیق کرو<small>جلدی آوے گی</small>

source: Validate readings submitted by community members
gju: کمیونٹی کا لوکاں کی طرفوں جمع کریا وی لکھائی کی تصدیق کروں

source: Validate user-recorded readings in your language
gju: اپنی زبان ما صارف کی ریکارڈ کری وی پڑھائی کی تصدیق کروں

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
gju: کامن وائس کا مقصد ما دتی وہ واز کی تصدیق مچ ضروری ہے۔ تمنا اس نا سنو تے واز کا عام دستیاب ذخیرہ نا جمع کرن ما مہاری مدد کرو۔

source: Validation Progress
gju: تصدیق ما پیشرفت

source: Validations
gju: توثیق

source: Value and recognition.
gju: اقدار تے پہچان

source: Variant Contribution Options
gju: تغیرات ما حصو لین کا بارہ ما انتخاب

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
gju: ویریئنٹ یا تبدیلی زبان کی ایک خاص قسم ہے - مثال کے طور پر جغرافیہ یا کمیونٹی ما رہن آلاں کے ذریعے مشترکہ چیز۔ کدے کدے انہاں بولی کہیں۔

source: Varying Pronunciations
gju: مختلف تلفّظ

source: Venetian
gju: وینیٹی

source: Version
gju: قسم(ورژن)

source: Very common mistakes include:
gju: عام مشتترک غلطیاں ما شامل وھے

source: Vietnamese
gju: ویتنامی

source: View your progress against personal and project goals.
gju: منصوبہ کا تے ذاتی مقصد کے سامنے اپنی ترقی دیکھو

source: Visible
gju: سامنے

source: Visit our blog or write about us
gju: مہارا خبراں کا حصہ نا دیکھو یا مہارے بارہ ما رائے دیو

source: Voice clips are entered into a submission queue that readies them for listening.
gju: وائس کا کلپ داخل کری جائے جمع کرن ہالی لین ما جہڑی اُنہاں نا سنن واسطے تیار کرے

source: Voice Collection
gju: وازاں کو مجموعو

source: Voice Contribution
gju: واز ما حصو لینو

source: Voice Dataset, Ready for Download
gju: وازاں کی عمومی ترتیب(ڈیٹا سیٹ) ڈاون لوڈ وسطے تیار

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
gju: واز قدرتی ہے تے واز انساناں تے نکلے۔ اسی وسطے ہم اپنی مشیناں وسطے واز کی قابل استعمال ٹیکنالوجی بنان ما بڑو جوش رکھاں۔ بارے واز کو نظام بنان وسطے ، ڈویلپرز مچ بڑی مقدار ما واز کی ضرورت ہووے ۔ ڈیٹا.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
gju: واز قدرتی ہے، واز انساناں تے ادا ہوویں۔ یاہی وجہ ہے جے ہم اپنی مشیناں وسطے قابل استعمال وازاں کی ٹیکنالوجی بنان اپر توجہ دیاں ۔ بارے صوتی نظام بنان وسطے زیادہ مقدار ما مچ زیادہ صوتی ذخیرہ کی ضرورت ہووے۔

source: Voices Online Now
gju: واز ہن آن لائن ہیں

source: Voice Validation
gju: واز کو اختیار

source: Volume
gju: واز کو والیم

source: Votic
gju: وٹک

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
gju: ووکس فورج نا مفت تے وازاں کی پہچان کا عام دستیاب انجن کے نال استعمال وسطے نقل شدہ تقریر جمع کرن وسطے قائم کیو گیو تھو۔

source: Wakhi
gju: واخی

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
gju: کامن وائس نا بہتر بنان واسطے کے مدد کری جائے ۔ مچ اعلیٰ ، جُڑیا رہوں ای میل کے ذریعے یا <discourseLink>بات چیت </discourseLink>فورم سائیٹ کا مسلہ جمع کرو ۔<githubLink>گِٹ ہب </githubLink>یا جُڑوں <matrixLink>میٹرکس </matrixLink>کمیونٹی چاٹ

source: Want to save your information? <createProfile>Create a profile</createProfile>
gju: تھاری معلومات نا محفوظ کرن چاہواں <createProfile> اپنو ایک تعارف تیار کرو </createProfile>

source: Want to stay in touch with Common Voice?
gju: کامن وائس کے نال رابطہ ما رہنو چاہے

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
gju: اپ ڈیٹ کرن کی لوڑ وھے جد کدی ہم نوی قسم شروع کراں کامن وائس کا ڈیٹا سیٹ کی ۔مھارا نیوذ لیٹر نا دیکھو

source: Watch our video explainer to help
gju: مھاری مدد کرن ہالی وضاحتی ویڈیو نا دیکھوں

source: Wayuunaiki
gju: وایونیکی

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
gju: ہم ہمیشہ معلومات استعمال کرن الا کا بارہ ما ان کی ضرورت تے سیاق و سباق سننو چاہواں معلومات جمع کرن کا پلیٹ فارم تے لیے درست تے مصدقہ معلومات تک ہمن<emailFragment> تھہارا تے سننو چاہواں </emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
gju: ہم وازاں کوایک کھلو تے عام لوکاں وسطے دستیاب ڈیٹا سیٹ بناواں لگا، جس نا ہر کوئی تقریر کے قابل ایپلی کیشنز نا تربیت دین وسطے استعمال کرسکے ۔

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
gju: ہم ٹیکنالوجی، نوئیں چیز تے زبان کے حقوق ما عام لوکاں کی شمولیت کی حمایت کرن وسطے پرجوش ہاں۔ جے کدے تم کائے بڑو کم یا مہم چلان کو ارادو کرو لگا تے مہربانی کر کے شروع کرو۔

source: We are going out to get a coffee.
gju: ہم باہر کافی پین چلاں لگا

source: We are going out to get coffee.
gju: ہما باہر کافی پین چلاں لگا

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
gju: ہم لوکاں نا اپنی جنس یا صنفی شناخت کا بارہ ما جو کجھ دساں۔اس ما انہاں مزید انتخاب دین وسطے مزید اختیارات پیش کراں۔ مہربانی کر کے تم اپنا اپ نا اس طرحیا بیان کرو جس جنس نا تم قدرتی طور محسوس کرو۔<learnMoreLink> جنس یا صنف بارہ ما مہاری رائے کا بارہ ما مزید سنو۔</learnMoreLink>

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
gju: ہم Mozilla ماوائس ٹیکنالوجی کے چوفیری ایک کمیونٹی بناواں لگا۔۔ ہم نوئیں چیز ، معلومات کا نواں طریقہ کے نال رابطہ ما رہنو چاہواں تے مزید سننو پسند کراں جے تم اس معلومات نا کس طرحیا استعمال کرو لگا۔

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
gju: ہمنا یقین ہے جے بڑا تے عام لوکاں وسطے دستیاب صوتی ڈیٹا سیٹ مشین کے ذریعے سکھن اپر مبنی گفتگو کی ٹیکنالوجی ما جدید طریقہ کار تے تجارت کا میدان ما صحیح طریقہ نال اگے بدہن نا عام کرے۔ یاہ ایک عالمی کوشش ہے تے ہم ساراں نا شرکت کی دعوت دیاں۔ مہارو مقصد یوہ ہے جے پوری دنیا کی بکھ بکھ وازاں کی عکاسی کرتاں گفتگو(گل بات) کی ٹینالوجی نا جامع بنان ما (لوکاں) کی مدد کراں۔

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
gju: مھارو یقین ہے کہ بڑا، عوامی سطح پو دستیاب واز کا ڈیٹا سیٹس مشین لرننگ پو مبنی تقریری ٹیکنالوجی ما جدت تے صحت مند تجارتی مقابلاں نا اگے بدھائے گا ۔ کامن وائس کا کثیر لسانی ڈیٹا سیٹ پہلاں ہی اپنی نوعیت کو سب تے بڑو عوامی ڈیٹو سیٹ ہے، لیکن یوہ ایکو نیہہ ہے۔ اس صفحہ کا دوجا اوپن سورس واز کا ڈیٹا سیٹس واسطے ایک حوالہ مرکز کا طور پو دیکھو تے جنوں جنوں کامن وائس ترقی کرےمھاری نوی ریلیز اپڈیٹس واسطے ایک مرکز کا طور پو استعمال کریں

source: Website Localization
gju: ویب سائیٹ لوکلائزیشن

source: Websites
gju: ویب سائیٹس۔

source: We couldn’t find that page for you
gju: ہمنا تھہارا وسطے وہ صفحو نیہہ لبھیو

source: We couldn’t get any audio clips for you to listen to. Please try again later.
gju: ہم نا تھارا سنان واسطے کوئی آڈیو کلپ نہ لبھو ۔برائے مہربانی بعد ما کوشش کروں

source: We couldn’t get any sentences for you to speak. Please try again later.
gju: ہم تھارے واسطے بولن کو کوئی جُملو حاصل نہ کر سکیا ۔برائے مہربانی دوبارہ کوشش کروں ۔

source: Weekly
gju: ہفتہ وار

source: Weekly Goal
gju: ہفتہ کو گول

source: We launch the Common Voice site in this language.
gju: ہم اس زبان ما نویں کامن وائس کی سائیٹ شروع کراں

source: Welcome { $company } staff!
gju: { $company } ممبراں نا ہر کدے آو کانہہ

source: Welcome to Common Voice
gju: عمومی وازاں (کامن وائس)اپر تمنا ہرکدے آو کانہہ

source: Welcome to Spontaneous Speech
gju: سپونٹینیس گل بات اپر تمنا ہر کدے آو کانہہ

source: Welsh
gju: ویلی

source: We may have run out of clips - refresh the page, or try again later.
gju: ہو سکے ہم نے کلپ چلایا ۔ صفحہ نا تازہ کروں ۔ یا بعد ما کوشش کروں

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
gju: ہمنا شاید یاہ درخواست نیہہ لبھی۔ تم براہ راست ہمنا <emailLink> { $email } </emailLink> اپر ای میل کرو بھی ہم تھہارے نال رابطو کراں گا۔

source: We periodically release the dataset
gju: ہم کدے کدے ڈیٹا سیٹ نا بھی دساں(شائع کراں)

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
gju: ہم وعدو کراں جے تھہاری معلومات کو مچ خیال نال رکھاں گا۔ تم مزید privacyLink> اپر مہارا ذاتی نوٹس </privacyLink> کا بارہ ما پڑھیوں۔

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
gju: ہم ایک کھلو ذریعو بناواں لگا ۔مختلف زباناں کی واز کو ڈیٹو سیٹ جس نا کوئی بھی ایسی اپلیکشن کی تربیت دین وسطے استعمال کر سکے جس ما مچ ساری وازاں کو انتخاب ہووے

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
gju: ہم وازاں کو ایک کھُلو ذریعو ڈیٹا سیٹ کراؤڈ سورس کراں لگا ۔ اپنی واز وقف کروں ، دوجا لوکاں کا کلپس کی درستگی کی تصدیق کروں، ڈیٹاسیٹ نا سب واسطے بہتر بناؤں ۔

source: We’re experiencing unexpected downtime
gju: ہم غیر متوقع اپر بند وخت کو سامنو کراں لگا۔
